Repository: alxspopov/sympy
Catalog: doc/src/tutorial/tutorial.*.po
Languages: de, fr, pl, ru, sr

source: Tutorial
fr: Tutoriel
ru: Краткое руководство
sr: Туторијал

source: SymPy is a Python library for symbolic mathematics. It aims to become a full-featured computer algebra system (CAS) while keeping the code as simple as possible in order to be comprehensible and easily extensible. SymPy is written entirely in Python and does not require any external libraries.
de: SymPy ist eine Python-Bibliothek für symbolische Mathematik. SymPy soll ein vollständiges Computer-Algebra-System (CAS) bereitstellen und dabei den Programmcode so einfach halten, dass er nachvollziehbar und einfach erweiterbar bleibt. SymPy ist vollständig in Python geschrieben und benötigt keine weiteren Bibliotheken.
fr: SymPy est une bibliothèque Python pour les mathématiques symboliques. SymPy prévoit devenir un système complet de calcul formel ("CAS" en anglais : "Computer Algebra System") tout en gardant le code aussi simple que possible afin qu'il soit compréhensible et facilement extensible. SymPy est entièrement écrit en Python et ne nécessite aucune bibliothèque externe.
pl: SymPy jest biblioteką Pythona służącą do wykonywania obliczeń symbolicznych. Za cel stawia sobie stanie się zaawansowanym, w pełni funkcjonalnym systemem algebry komputerowej (ang. Computer Algebra System, w skrócie CAS). Przy tym dąży do zachowania kodu tak prostego, jak to tylko możliwe, by był on zrozumiały i elastyczny. SymPy został napisany całkowicie w Pythonie i nie wymaga żadnych zewnętrznych bibliotek.
ru: SymPy представляет собой открытую библиотеку символьных вычислений на языке Python. Цель SymPy - стать полнофункциональной системой компьютерной алгебры (CAS), при этом сохраняя код максимально понятным и легко расширяемым. SymPy полностью написан на Python и не требует сторонних библиотек.
sr: SymPy je Python библиотека за симболичку математику. Циља да постане потпуно садржани алгебарски систем (енглески CAS: "Computer Algebra System"), чувајући код једноставнијим колико је могуће да би била разумљива и лакше проширива. SymPy је комплетно написан у програмском језику Python и не захтева никакве екстерне библиотеке.

source: This tutorial gives an overview and introduction to SymPy. Read this to have an idea what SymPy can do for you (and how) and if you want to know more, read the :ref:`SymPy User's Guide <guide>`, the :ref:`SymPy Modules Reference <module-docs>`, or the `sources <https://github.com/sympy/sympy/>`_ directly.
de: Dieses Tutorial schafft einen Überblick und gibt eine Einführung in SymPy. Wenn du wissen möchtest, was SymPy tun kann (und wie), lies diese Seite, und wenn du mehr erfahren möchtest, lies den `SymPy User's Guide <../guide.html>`_, die `SymPy Modules Reference <../modules/index.html>`_, oder den `Quellcode <https://github.com/sympy/sympy/>`_ selbst.
fr: Ce tutoriel donne un aperçu et une introduction à SymPy. Lisez-le pour vous faire une idée de ce que SymPy peut faire pour vous (et comment). Pour en savoir plus, consultez également le `SymPy User's Guide <../guide.html>`_, la `SymPy Modules Reference <../modules/index.html>`_, ou le `code source <https://github.com/sympy/sympy/>`_ directement.
pl: Ten tutorial przedstawia ogólny zarys i przegląd wybranych funkcji SymPy. Dzięki niemu dowiesz się, co SymPy może dla Ciebie zrobić (i jak). Jeśli będziesz chciał dowiedzieć się więcej, przeczytaj `Przewodnik użytkownika <../guide.html>`_, `Opis modułów <../modules/index.html>`_, lub też bezpośrednio `źródła <https://github.com/sympy/sympy/>`_.
ru: Данное руководство представляет из себя введение в SymPy. В нем вы узнаете об основных возможностях SymPy и каким образом использовать эту программу. Если же вы желаете прочитать более подробное руководство, то обратитесь к `Руководству пользователя SymPy <../guide.html>`_, `Описанию модулей SymPy <../modules/index.html>`_, Можно также обратиться и к `исходному коду <https://github.com/sympy/sympy/>`_ библиотеки.
sr: Овај туторијал даје вам преглед и увод у SymPy. Прочитајте га да бисте имали идеју шта SymPy можете урадити (и како) а ако хоћете да сазнате више, прочитајте `SymPy кориснички водич <../guide.html>`_, `SymPy референтни модул <../modules/index.html>`_, или `изворни код <https://github.com/sympy/sympy/>`_ директно.

source: First Steps with SymPy
de: Erste Schritte mit SymPy
fr: Premiers pas avec SymPy
pl: Pierwsze kroki z SymPy
ru: Первые шаги с SymPy
sr: Први кораци

source: The easiest way to download it is to go to http://code.google.com/p/sympy/ and download the latest tarball from the Featured Downloads:
de: Am einfachsten kannst du SymPy mit der aktuellsten .tar-Datei aus den "Featured Downloads" von http://code.google.com/p/sympy/ installieren:
fr: La façon la plus simple de télécharger SymPy est de se rendre sur http://code.google.com/p/sympy/ et de télécharger la dernière archive des Téléchargements Recommandés ("Featured Downloads" en anglais).
pl: Żeby ściągnąć SymPy udaj się pod adres http://code.google.com/p/sympy/ i pobierz ostatniego tarballa z sekcji Featured Downloads:
ru: Скачать SymPy проще всего с http://code.google.com/p/sympy/. В разделе Featured, Downloads нужно найти и загрузить последнюю версию дистрибутива:
sr: Најлакши начин да се преузме је да одете на http://code.google.com/p/sympy/ и преузмeте последњу архиву из истакнутих преузимања:

source: Unpack it:
de: Dann musst du die Datei auspacken:
fr: Décompressez-la :
pl: Rozpakuj:
ru: Для Windows-систем, нужно скачать и запустить установочный .exe файл. В POSIX-совместимых системах нужно скачать .tar.gz файл и распаковать его:
sr: Отпакујте:

source: and try it from a Python interpreter:
de: und kannst sie mit einem Python-Interpreter ausprobieren.
fr: et essayez-la dans un interpréteur Python :
pl: i sprawdź pod interpreterem Pythona:
ru: и запустить из интерпретатора Python:
sr: и покушајте из Python интерпретера:

source: You can use SymPy as shown above and this is indeed the recommended way if you use it in your program. You can also install it using ``./setup.py install`` as any other Python module, or just install a package in your favourite Linux distribution, e.g.:
de: SymPy kann wie im Beispiel gezeigt benutzt werden, und dies ist auch der übliche Weg, es von einem anderen Programm aus zu verwenden. Du kannst es ebenfalls wie jedes andere Modul mithilfe von ``./setup.py install`` installieren. Auch ist es natürlich möglich, einfach ein Paket deiner Linux-Distribution zu verwenden, zum Beispiel:
fr: Vous pouvez utiliser SymPy comme illustré ci-dessus et c'est en effet la méthode recommandée si vous voulez l'utiliser dans votre programme. Vous pouvez aussi l'installer en utilisant ``./setup.py install`` comme tout autre module Python, ou simplement installer un paquet dans votre distribution Linux préférée, par exemple :
pl: Możesz używać SymPy tak jak pokazano powyżej - ten sposób jest zalecany, jeśli używasz SymPy w swoim własnym programie. Możesz też zainstalować SymPy użwając ``./setup.py install`` (jak w przypadku każdego modułu Pythona), albo po prostu zainstalować odpowiednią paczkę w używanej przez siebie dystrybucji Linuksa, np.:
ru: Если вы собираетесь использовать SymPy в вашей программе как модуль, рекомендуется обращаться к нему таким же способом, как показано выше. Установить модуль в систему можно или из скаченных исходников, используя команду ./setup.py install. Или, если вы работаете в Linux, можно установить пакет ``python-sympy`` с помощью системы установки программ:
sr: Можете да користите SymPy како је указано горе и то је препоручен начин ако се користи у вашем програму. Такође га можете инсталирати користећи ``./setup.py install`` као и сваки други Python модул, или само инсталирати пакет ваше Линукс дистрибуције:

source: For other means how to install SymPy, consult the wiki page `Download and Installation <https://github.com/sympy/sympy/wiki/Download-Installation>`_.
de: Weitere Installationsmöglichkeiten findest du unter `Download and Installation (auf Englisch) <https://github.com/sympy/sympy/wiki/Download-Installation>`_ auf der SymPy-Wiki.
fr: Pour d'autres moyens d'installer SymPy, consultez `Download and Installation (en anglais) <https://github.com/sympy/sympy/wiki/Download-Installation>`_ sur le site wiki de SymPy.
ru: Другие способы установки SymPy описаны в разделе `Download and Installation <https://github.com/sympy/sympy/wiki/Download-Installation>`_ нашего Вики.

source: isympy Console
de: isympy-Konsole
fr: La console isympy
pl: isympy
ru: Консоль isympy
sr: isympy конзола

source: For experimenting with new features, or when figuring out how to do things, you can use our special wrapper around IPython called ``isympy`` (located in ``bin/isympy`` if you are running from the source directory) which is just a standard Python shell that has already imported the relevant SymPy modules and defined the symbols x, y, z and some other things:
de: Für Experimente mit neuen Funktionen und zum Ausprobieren kann die um IPython aufgebaute Umgebung namens ``isympy`` (im Quellverzeichnis unter ``bin/isympy``) benutzt werden. Es handelt sich hierbei nur um eine Standard-Python-Konsole, die allerdings bereits die wichtigen sympy-Module importiert hat und unter anderem die Symbole x, y und z bereits definiert hat:
fr: Pour tester de nouvelles fonctionnalités, ou si vous cherchez à savoir comment accomplir certaines choses, vous pouvez utiliser notre emballage (wrapper) spécial enrobant IPython appelé ``isympy`` (situé dans ``bin/isympy`` si vous vous trouvez dans le répertoire source). Cette commande lance un shell Python standard qui importe les modules SymPy les plus courants, les symboles définis x, y, z et d'autres choses à l'avance :
ru: SymPy можно использовать не только как модуль, но и как отдельную программу ``isympy``, которая расположена в папке ``bin`` относительно директории с исходным кодом. Программа удобна для экспериментов с новыми функциями или для обучения SymPy. Она использует стандартный терминал IPython, но с уже включенными в нее важными модулями SymPy и определенными переменными x, y, z:

source: Commands entered by you are bold. Thus what we did in 3 lines in a regular Python interpreter can be done in 1 line in isympy.
de: Benutzereingaben sind fett dargestellt. Was in einem normalen Python-Interpreter drei Zeilen gebraucht hätte, kann mit isympy in nur einer Zeile ausgedrückt werden.
fr: Les commandes que vous entrez sont en gras. Ainsi ce que nous avons fait en 3 lignes dans un interpréteur Python habituel peut être fait en une ligne avec isympy.
pl: Polecenia wprowadzane przez Ciebie są pogrubione. Tak więc to, co zrobiliśmy w trzech linijkach w zwykłym interpreterze Pythona, może być zrobione w jednej linijce w isympy.
ru: Команды введенные вами, обозначены жирным шрифтом. То, что мы делали тремя строчками в стандартном терминале Python, мы можем сделать одной строчкой в isympy. Кроме того программа поддерживает различные способы отображения результатов, в том числе графические.
sr: Команде су подебљане. То што смо урадили са 3 линије у регуларном Python интерпретеру може бити урађено у једној линији у isympy.

source: Using SymPy as a calculator
de: Mit SymPy rechnen
fr: Utiliser SymPy comme une calculatrice
pl: SymPy jako kalkulator
ru: Использование SymPy в качестве калькулятора
sr: SymPy као дигитрон

source: SymPy has three built-in numeric types: Float, Rational and Integer.
de: SymPy hat drei eingebaute Zahlentypen: Float, Rational und Integer.
fr: SymPy possède trois types numériques natifs : Float (Flottant), Rational (Rationnel) et Integer (Entier).
ru: SymPy поддерживает три типа численных данных: Float, Rational и Integer.

source: The Rational class represents a rational number as a pair of two Integers: the numerator and the denominator. So Rational(1, 2) represents 1/2, Rational(5, 2) represents 5/2, and so on.
de: Die Klasse Rational stellt eine rationale Zahl als Paar von zwei Ganzzahlen dar: dem Zähler und dem Nenner. Rational(1, 2) repräsentiert also 1/2, Rational(5, 2) repräsentiert 5/2 und so weiter.
fr: La classe Rational représente un nombre rationnel en tant que paire de deux Integers : le numérateur et le dénominateur. Donc Rational(1, 2) représente 1/2, Rational(5, 2) représente 5/2, et ainsi de suite.
pl: Klasa Rational reprezentuje liczbę wymierną jako parę dwóch liczb całkowitych - licznik i mianownik. Rational(1, 2) reprezentuje więc 1/2, Rational(5, 2) reprezentuje 5/2 itd.
ru: Rational представляет собой обыкновенную дробь, которая задается с помощью двух целых чисел: числителя и знаменателя. Например, Rational(1, 2) представляет дробь 1/2, Rational(5, 2) представляет дробь 5/2, и так далее.
sr: Класа "Rational" представља рацоинални број као пар од два цела, именилац и садржилац, тако да рационални број Rational(1, 2) представаља 1/2, Rational(5, 2) представља 5/2 и тако даље.

source: Proceed with caution while working with Python int's and floating point numbers, especially in division, since you may create a Python number, not a SymPy number. A ratio of two Python ints may create a float -- the "true division" standard of Python 3 and the default behavior of ``isympy`` which imports division from __future__:
de: Beim Arbeiten mit Pythons Ganzzahlen und Fließkommazahlen ist Vorsicht geboten, besonders bei Division, da eine Python-Zahl statt einer SymPy-Zahl das Ergebnis sein kann. Eine Division von zwei Python-Ganzzahlen hat eine Fließkommazahl zum Ergebnis -- die "echte Divison" von Python 3 und das Standardverhalten von ``isympy``, welches division aus __future__ importiert:
fr: Faites attention lorsque vous travaillez avec les nombres entiers et à virgule flottante de Python, surtout dans des divisions, puisque vous pourriez créer un nombre Python, et non pas un nombre SymPy. Un ratio de deux entiers Python pourrait créer un flottant -- la "vraie division", standard sous Python 3 et le comportement par défaut de ``isympy`` qui importe l'opération division du module __future__ :
pl: Należy zachować ostrożność, pracując z liczbami całkowitymi i zmiennoprzecinkowymi w Pythonie, szczególnie podczas dzielenia. Można bowiem przypadkowo utworzyć liczbę obsługiwaną przez samego Pythona, a nie przez SymPy. Dzielenie przez siebie dwóch Pythonowych liczb całkowitych może dać w wyniku liczbę zmiennoprzecinkową -- jest to standard "prawidłowego dzielenia" z Pythona 3 i domyślne zachowanie ``isympy``, który importuje dzielenie z __future__:
ru: Важная особенность Python-интерпретатора, о которой нужно сказать отдельно, связана с делением целых чисел При делении двух питоновских чисел типа int с помощью оператора "/" в старых версиях Python в результате получается число питоновского типа int. В Python 3 этот стандарт изменен на "true division", и в результате получается питоновский тип float.И этот же стандарт "true division" по умолчанию включен и в isympy:
sr: Наставите са пажњом док радите са целим и променљивим бројевима, посебно у дељењу, јер можете направити Python број, а не SymPy број. Однос два цела броја у Python може направити променљливи -- истинито дељење(true divison) стандардно за Python 3 у подразумевано понашање ``isympy`` који увози дељење из __future__:

source: But in earlier Python versions where division has not been imported, a truncated int will result:
de: In älteren Python-Versionen ohne den Import von division ist das Ergebnis hingegen eine abgerundete Ganzzahl:
fr: Cependant, dans les versions antérieures à Python 3, l'opération division résulte par défaut en une divison euclidienne et entraînera :
pl: We wcześniejszych wersjach Pythona, gdzie takie dzielenie nie było zaimportowane, wynik był ucinany do liczby całkowitej:
ru: В более ранних версиях Python этого не получится, и результатом будет целочисленное деление:
sr: Али у ранијим Python верзијама где дељење није увежено, скраћени цели број ће бити резултат:

source: In both cases, however, you are not dealing with a SymPy Number because Python created its own number. Most of the time you will probably be working with Rational numbers, so make sure to use Rational to get the SymPy result. One might find it convenient to equate ``R`` and Rational:
de: In beiden Fällen handelt es sich jedoch nicht um eine SymPy-Zahl, weil Python seine eigenen Zahl zurückgegeben hat. Meistens wirst du aber mit Zahlen des Typs Rational arbeiten wollen, also achte darauf, auch solche zu erhalten. Oft wird zur besseren Lesbarkeit ``R`` mit Rational gleichgesetzt:
fr: Dans les deux cas, toutefois, vous n'avez pas affaire à un nombre SymPy parce que Python a créé son propre nombre. La plupart du temps vous travaillerez fort probablement avec des nombres rationels, alors prenez garde à utiliser Rational pour obtenir le résultat en terme d'objets SymPy. On pourrait trouver pratique d'assigner Rational à ``R`` :
pl: Jednakże, w obu przypadkach, nie operowaliśmy na liczbach obsługiwanych przez SymPy, ponieważ Python stworzył swoją własną zmienną. Prawdopodobnie większość czasu będziesz operował na liczbach wymiernych -- dlatego upewnij się, że na pewno używasz klasy Rational, aby uzyskać prawidłowy wynik obsługiwany przez SymPy. Dla wygody możesz na przykład przyrównać ``R`` i Rational:
ru: Обратите внимание, что и в том и в другом случае вы имеете дело не с объектом Number из библиотеки SymPy, который представляет число в SymPy, а с питоновскими числами, которые создаются самим интерпретатором Python. Скорее всего, вам нужно будете работать с дробными числами из библиотеки SymPy, поэтому для того чтобы получать результат в виде объектов SymPy убедитесь, что вы используете класс Rational. Кому-то может показаться удобным обозначать Rational как ``R``:
sr: У оба случаја, ипак, не радите са SymPy бројевима јер је Python креирао своје посебне бројеве. Већину времена ћете вероватно радити са рационалним бројевима, тако да будите сигурни да користите рационалне бројеве да бисте добили SymPy резултат. Могло би бити згодно изједначити ``R`` и Rational:

source: We also have some special constants, like e and pi, that are treated as symbols (1 + pi won't evaluate to something numeric, rather it will remain as 1 + pi), and have arbitrary precision:
de: Es gibt auch einige spezielle Konstanten wie e oder pi, die als Symbole behandelt werden (1 + pi wird nicht als Zahl ausgerechnet, sondern bleibt 1 + pi) und in beliebiger Präzision verfügbar sind:
fr: SymPy offre également quelques constantes spéciales, comme e et pi, qui sont traitées comme des symboles (1 + pi ne sera pas évalué sous forme numérique, mais restera plutôt sous la forme 1 + pi), et qui ont une précision arbitraire :
pl: Możemy skorzystać też z kilku specjalnych stałych, takich jak e czy pi. Są one traktowane jako symbole (np. w przypadku 1 + pi nie zostanie obliczona przybliżona wartość tego wyrażenia, lecz pozostanie ono jako 1 + pi), i mają arbitralną precyzję:
ru: В модуле Sympy имеются особые константы, такие как e и pi, которые ведут себя как переменные (то есть выражение 1 + pi не преобразуется сразу в число, а так и останется 1 + pi):
sr: Такође имамо неке специјалне константе као e и pi, који се третирају као симболи (1 + pi неће прерачунати у нумерчку форму, већ ће остати као 1 + pi), могу имати произвољну прецизност:

source: as you see, evalf evaluates the expression to a floating-point number
de: Wie man sieht, berechnet evalf aus dem Ausdruck eine Fließkommazahl.
fr: Comme vous le voyez, evalf convertit l'expression en un nombre à virgule flottante.
pl: Jak widzisz, evalf wylicza wartość wyrażenia jako liczbę zmiennoprzecinkową.
ru: как вы видите, функция evalf переводит исходное выражение в число с плавающей точкой. Вычисления можно проводить с большей точностью. Для этого нужно передать в качестве аргумента этой функции требуемое число десятичных знаков.
sr: као што видите, evalf рачуна израз у реалан број

source: The symbol ``oo`` is used for a class defining mathematical infinity:
de: Das Symnol ``oo`` wird für eine Klasse benutzt, die mathematische Unendlichkeit darstellt:
fr: Le symbole ``oo`` est utilisé pour une classe définissant l'infini mathématique :
pl: Symbol ``oo`` jest używany jako klasa definiująca matematyczną nieskończoność:
ru: Для работы с математической бесконечностью используется символ ``oo``:
sr: Симбол ``oo`` представља бесконачно:

source: Symbols
de: Symbole
fr: Symboles
pl: Symbole
ru: Переменные
sr: Симболи

source: In contrast to other Computer Algebra Systems, in SymPy you have to declare symbolic variables explicitly:
de: Im Gegensatz zu anderen Computer-Algebra-Systemen müssen in SymPy symbolische Variablen ausdrücklich deklariert werden:
fr: Contrairement à d'autres systèmes de calcul formel, SymPy vous oblige à déclarer les variables symboliques explicitement :
pl: W przeciwieństwie do innych systemów algebry komputerowej (CAS), w SymPy sam musisz zadeklarować zmienne symboliczne:
ru: В отличие от многих других систем компьютерной алгебры, вам нужно явно декларировать символьные переменные:
sr: За разлику од осталих компјутерских алгебарских система, у SymPy ви морате да декларишете симболичке променљиве експлицитно:

source: On the left is the normal Python variable which has been assigned to the SymPy Symbol class. Predefined symbols (including those for symbols with Greek names) are available for import from abc:
de: Links steht eine normale Python-Variable, der ein SymPy-Symbol-Objekt zugewiesen wird. Vordefiniert Symbole (inklusiv Symbole mit griechischen Namen) sind von Import von abc verfügbar:
fr: À gauche se trouve la variable Python normale à laquelle est assignée une instance de la classe Symbol de SymPy. Certains symboles prédefinis (dont les symboles portant un nom grec) sont disponibles après importation :
ru: В левой части этого выражения находится переменная Python, которая питоновским присваиванием соотносится с объектом класса Symbol из SymPy.

source: Symbols can also be created with the ``symbols`` or ``var`` functions, the latter automatically adding the created symbols to the namespace, and both accepting a range notation:
de: Symbole können auch mit den ``symbols`` oder ``var`` Funktionen erstellt werden. Die letztere fügt automatisch die Symbole in den Namespace ein, und beide Funktionen akzeptieren eine Reihennotation:
fr: Plusieurs symboles peuvent également être déclarés en utilisant une seule commande avec les fonctions ``symbols`` ou ``var``. Ces fonctions acceptent une chaîne de texte contenant une liste ou un interval de symboles à déclarer, la variante ``var`` ajoutant également les symboles à la liste de noms courante (namespace) :
ru: Символьные переменные могут также задаваться и с помощью функций ``symbols`` или ``var``. Они допускают указание диапазона. Их отличие состоит в том, что ``var`` добавляет созданные переменные в текущее пространство имен:

source: Instances of the Symbol class "play well together" and are the building blocks of expresions:
de: Aus Symbol-Objekten kann man bequem Ausdrücke zusammensetzen:
fr: Les instances de la classe Symbol travaillent ensemble et sont les fondements nécessaires pour construire des expressions :
ru: Экземпляры класса Symbol взаимодействуют друг с другом. Таким образом, с помощью них конструируются алгебраические выражения:

source: They can be substituted with other numbers, symbols or expressions using ``subs(old, new)``:
de: Sie können mit ``subs(old, new)`` durch Zahlen, andere Symbole oder Ausdrücke ersetzt werden:
fr: Elles peuvent être remplacées par d'autres nombres, symboles ou expressions grâce à l'utilisation de ``subs(old, new)`` :
pl: Można podstawiać w ich miejsce inne symbole i liczby używając ``subs(stary, nowy)``:
ru: Переменные могут быть заменены на другие переменные, числа или выражения с помощью функции подстановки ``subs(old, new)``:
sr: Они могу бити замењени са другим бројевима, симболима или изразима користећи команду ``subs(old, new)``:
