Repository: alxspopov/sympy
Catalog: doc/src/tutorial/tutorial.*.po
Languages: de, fr, pl, ru, sr

source: For the remainder of the tutorial, we assume that we have run:
de: Für den Rest des Tutorials gehen wir davon aus, dass folgende Zeile ausgeführt wurde:
fr: Pour le reste du tutoriel, il est présumé que nous avons exécuté :
pl: W pozostałej części tutoriala zakładamy, że wykonaliśmy następujące polecenie:
ru: Теперь, с этого момента, для всех написанных ниже примеров мы будем предполагать, что запустили следующую команду по настройке системы отображения результатов:
sr: За остатак овог туторијала, претпостављамо да смо извршили:

source: This will make things look better when printed. See the :ref:`printing-tutorial` section below. If you have a unicode font installed, you can pass use_unicode=True for a slightly nicer output.
de: Dies sorgt dafür, dass Ausdrücke bei der Ausgabe besser aussehen (siehe :ref:`printing-tutorial` weiter unten). Wenn eine Unicode-Schrift installiert ist, erreichst du mit use_unicode=True eine noch hübschere Ausgabe.
fr: Ceci donnera un meilleur aspect aux résultats affichées. Pour en savoir plus sur l'affichage, consultez la section :ref:`printing-tutorial` ci-dessous. Si vous avez une police unicode installée, vous pouvez passer use_unicode=True pour un affichage un peu plus agréable.
pl: Dzięki temu wszystko będzie się ładnie wyświetlało (zobacz sekcję :ref:`printing-tutorial` poniżej). Jeśli masz zainstalowaną czcionkę unicode, możesz zamienić use_unicode=False na use_unicode=True, dzięki czemu uzyskasz nieco ładniejsze wyjście.
ru: Она придаст более качественное отображение выражений. Подробнее по системе отображения и печати написано в разделе :ref:`printing-tutorial`. Если же у вас установлен шрифт с юникодом, вы можете использовать опцию use_unicode=True для еще более красивого вывода.
sr: Ово ће лепше штампати резултате. Погледајте :ref:`printing-tutorial` секцију. Ако имате неки уникод фонт инсталиран, можете користити use_unicode=True за много лепше резултате.

source: Algebra
fr: Algèbre
ru: Алгебра
sr: Алгебра

source: For partial fraction decomposition, use ``apart(expr, x)``:
de: Für die Partialbruchzerlegung kannst du ``apart(expr, x)`` benutzen:
fr: Pour la décomposition en éléments simples des fractions, utilisez ``apart(expr, x)`` :
pl: Żeby dokonać rozkładu na ułamki proste, użyj ``apart(wyrażenie, x)``:
ru: Чтобы разложить выражение на простейшие дроби используется функция ``apart(expr, x)``:
sr: За делимични разломак, користите ``apart(expr, x)``:

source: To combine things back together, use ``together(expr, x)``:
de: Zum Kombinieren gibt es die Funktion ``together(expr, x)``:
fr: Pour remettre tout ensemble, utilisez ``together(expr, x)`` :
pl: Aby wszystko znowu ze sobą połączyć, użyj ``together(wyrażenie, x)``:
ru: Чтобы снова привести дробь к общему знаменателю используется функция ``together(expr, x)``:
sr: Да бисте комбиновали ствари заједно, користите ``together(expr, x)``:

source: Calculus
de: Infinitesimalrechnung
fr: Calcul
pl: Rachunek różniczkowy i całkowy
ru: Вычисления
sr: Математичка анализа

source: Limits
de: Limes
fr: Limites
pl: Granice
ru: Пределы
sr: Лимити

source: Limits are easy to use in SymPy, they follow the syntax ``limit(function, variable, point)``, so to compute the limit of f(x) as x -> 0, you would issue ``limit(f, x, 0)``:
de: Grenzwerte sind in SymPy einfach zu benutzen, sie folgen der Syntax ``limit(function, variable, point)``, um also den Grenzwert von f(x) bei x -> 0 zu berechnen, kann ``limit(f, x, 0)`` benutzt werden:
fr: Les limites sont simples à utiliser dans SymPy, elles suivent la syntaxe ``limit(function, variable, point)``, donc pour calculer la limite de f(x) pour x tendant vers 0, il suffit d'entrer ``limit(f, x, 0)`` :
ru: Пределы считаются в SymPy очень легко. Чтобы вычислить предел функции, используйте функцию ``limit(function, variable, point)``. Например, чтобы вычислить предел f(x) при x -> 0, вам нужно ввести ``limit(f, x, 0)``:

source: you can also calculate the limit at infinity:
de: Analog kann der Limes für x gegen unendlich berechnet werden:
fr: Vous pouvez aussi calculer la limite tendant vers l'infini :
pl: Można również obliczyć granicę w nieskończoności:
ru: также вы можете вычислять пределы при x, стремящемся к бесконечности:
sr: Можете такође израчунати у бесконачности:

source: for some non-trivial examples on limits, you can read the test file `test_demidovich.py <https://github.com/sympy/sympy/blob/master/sympy/series/tests/test_demidovich.py>`_
de: Einige nicht-triviale Beispiele zu Grenzwerten finden sich in der Datei `test_demidovich.py <https://github.com/sympy/sympy/blob/master/sympy/series/tests/test_demidovich.py>`_
fr: Pour des exemples non-triviaux de limites, vous pouvez lire le fichier de test `test_demidovich.py <https://github.com/sympy/sympy/blob/master/sympy/series/tests/test_demidovich.py>`_
pl: Kilka nietrywialnych przykładów granic znajdziesz w pliku testowym `test_demidovich.py <https://github.com/sympy/sympy/blob/master/sympy/series/tests/test_demidovich.py>`_
ru: Для более сложных примеров вычисления пределов, вы можете обратится к файлу с тестами `test_demidovich.py <https://github.com/sympy/sympy/blob/master/sympy/series/tests/test_demidovich.py>`_
sr: За неке не-тривијалне примере са лимитима, можете прочитати тест датотеку `test_demidovich.py <https://github.com/sympy/sympy/blob/master/sympy/series/tests/test_demidovich.py>`_

source: Differentiation
de: Differentialrechnung
fr: Dérivation
pl: Różniczkowanie
ru: Дифференцирование
sr: Изводи

source: You can differentiate any SymPy expression using ``diff(func, var)``. Examples:
de: Mithilfe von ``diff(func, var)`` kann jeder SymPy-Ausdruck differenziert werden. Beispiele:
fr: Vous pouvez dériver n'importe quelle expression SymPy en utilisant ``diff(func, var)``. Exemples :
pl: Możesz różniczkować dowolne wyrażenie w SymPy używając ``diff(funkcja, zmienna)``. Przykłady:
ru: Продифференцировать любое выражение SymPy, можно используя ``diff(func, var)``. Примеры:
sr: Можете израчунати извод сваког израза користећи ``diff(func, var)``. Примери:

source: You can check, that it is correct by:
de: Folgendermaßen kann überprüft werden, ob dies korrekt ist:
fr: Vous pouvez vérifier que c'est correct avec :
pl: Możesz też sprawdzić poprawność:
ru: Можно, кстати, через пределы проверить правильность вычислений производной:
sr: можете проверити да ли је то тачно са:

source: Higher derivatives can be calculated using the ``diff(func, var, n)`` method:
de: Höhere Ableitungen können mithilfe von ``diff(func, var, n)`` berechnet werden:
fr: Des dérivées d'ordre supérieur peuvent être calculées en utilisant la méthode ``diff(func, var, n)`` :
pl: Pochodne wyższych rzędów mogą być obliczone przy użyciu ``diff(funkcja, zmienna, n)``:
ru: Производные более высших порядков можно вычислить, используя дополнительный параметр этой же функции ``diff(func, var, n)``:
sr: Виши изводи се могу израчунати користећи метод ``diff(func, var, n)``:

source: Series expansion
de: Reihenentwicklung
fr: Développement en série
pl: Rozwinięcie w szereg
ru: Разложение в ряд
sr: Развој редова

source: Use ``.series(var, point, order)``:
de: Benutze ``.series(var, point, order)``:
fr: Utilisez ``.series(var, point, order)`` :
pl: Użyj ``.series(var, point, order)``:
ru: Для разложения в ряд используйте метод ``.series(var, point, order)``:
sr: Користите ``.series(var, point, order)``:

source: Another simple example:
de: Ein weiteres einfaches Beispiel:
fr: Un autre exemple simple :
pl: Inny prosty przykład:
ru: Еще один простой пример:
sr: Још један једноставан пример:

source: Summation
fr: Sommes

source: Compute the summation of f with respect to the given summation variable over the given limits.
fr: Calcule la somme de f indexée sur la variable muette donnée entre les limites données.

source: summation(f, (i, a, b)) computes the sum of f with respect to i from a to b, i.e.,
fr: summation(f, (i, a, b)) calcule la somme de f sur la variable muette i entre les limites a et b, c'est-à-dire :

source: If it cannot compute the sum, it prints the corresponding summation formula. Repeated sums can be computed by introducing additional limits:
fr: Si la somme ne peut pas être résolue, la formule de sommation correspondante est imprimée. Les sommes répétées peuvent être calculées en introduisant des limites additionnelles.

source: Integration
de: Integralrechnung
fr: Intégration
pl: Całkowanie
ru: Интегрирование
sr: Интеграција

source: SymPy has support for indefinite and definite integration of transcendental elementary and special functions via ``integrate()`` facility, which uses powerful extended Risch-Norman algorithm and some heuristics and pattern matching:
de: SymPy unterstützt unendliche und endliche Integration transzendenter elementarer und spezieller Funktionen durch ``integrate()``, welches den starken Risch-Norman-Algorithmus nutzt, sowie einige Heuristiken und Mustererkennungen:
fr: SymPy supporte l'intégration définie et indéfinie de fonctions élémentaires et spéciales avec ``integrate()``, qui utilise le puissant algorithme de Risch-Norman étendu et quelques heuristiques ainsi que le filtrage par motif :
pl: SymPy potrafi obliczyć całki oznaczone i nieoznaczone dla niektórych funkcji poprzez ``integrate()``. Używany jest do tego rozszerzony algorytm Rischa-Normana, kilka heurystyk i wyszukiwanie wzorca:
ru: SymPy поддерживает вычисление определенных и неопределенных интегралов с помощью функции ``integrate()``. Она использует расширенный алгоритм Риша-Нормана и некоторые шаблоны и эвристики. Можно вычислять интегралы трансцендентных, простых и специальных функций:
sr: SymPy има подршку за одређену и неодређену интеграцију трансцендентних, елементарних и специјалних функција преко методе ``integrate()`` које користи моћни проширени Risch-Norman алгоритам и неке хеуристике и обрасце поклапања:

source: You can integrate elementary functions:
de: Es können elementare Funktionen integriert werden:
fr: Vous pouvez intégrer des fonctions élémentaires :
pl: Możesz całkować podstawowe funkcje:
ru: Вы можете интегрировать простейшие функции:
sr: Можете интегрирати елементарне функције:

source: Also special functions are handled easily:
de: Aber auch mit speziellen Funktionen kann einfach umgegangen werden:
fr: Les fonctions spéciales sont aussi facilement gérées :
pl: Bardziej skomplikowane funkcje również są obsługiwane:
ru: Примеры интегрирования некоторых специальных функций:
sr: Можете користити и разне специјалне функције:

source: It is possible to compute definite integrals:
de: Es ist möglich, ein endliches Integral zu berechnen:
fr: Il est possible de calculer l'intégrale définie :
ru: Возможно также вычислить определенный интеграл:

source: Also, improper integrals are supported as well:
de: Auch uneigentliche Integrale werden unterstützt:
fr: Les intégrales impropres sont aussi supportées :
ru: Поддерживаются и несобственные интегралы:

source: Complex numbers
de: Komplexe Zahlen
fr: Nombres complexes
pl: Liczby zespolone
ru: Комплексные числа
sr: Комплексни бројеви

source: Besides the imaginary unit, I, which is imaginary, symbols can be created with attributes (e.g. real, positive, complex, etc...) and this will affect how they behave:
de: Mit Ausnahme der imaginären Einheit, I, die rein imaginär ist, können Symbole mit Attributen (z.B. reale, positive, komplex, usw.) erstellt werden, und dies hat Auswirkungen darauf, wie sie sich verhalten:
fr: Outre l'unité imaginaire, I, qui est imaginaire, les symboles peuvent être créés avec certains attributs (par exemple réel, positif, complexe, etc.) affectant leur comportement :
ru: Помимо мнимой единицы I, которое является мнимым числом, символы тоже могут иметь специальные атрибуты (real, positive, complex и т.д), которые определяют поведение этих символов при вычислении символьных выражений:

source: Functions
de: Funktionen
fr: Fonctions
pl: Funkcje
ru: Функции
sr: Функције

source: **trigonometric**
de: **trigonometrische**
fr: **trigonométrie**
pl: **trygonometria**
ru: **тригонометрические**
sr: **тригонометријске**

source: **spherical harmonics**
de: **Kugelflächen**
fr: **harmoniques sphériques**
pl: **harmoniki sferyczne**
ru: **сферические**
sr: **сферне хармонике**

source: **factorials and gamma function**
de: **Fakultät und Gamma-Funktion**
fr: **factorielles et fonction gamma**
pl: **silnia i funkcja gamma**
ru: **факториалы и гамма-функции**
sr: **Факторијали и гама функције**

source: **zeta function**
de: **Zeta-Funktion**
fr: **fonction zeta**
pl: **funkcja zeta**
ru: **дзета-функции**
sr: **Зета функције**

source: **polynomials**
de: **Polynome**
fr: **polynômes**
pl: **wielomiany**
ru: **многочлены**
sr: **Полиноми**

source: Differential Equations
de: Differenzialgleichungen
fr: Équations différentielles
pl: Równania różniczkowe
ru: Дифференциальные уравнения
sr: Диференцијални рачун

source: In ``isympy``:
fr: Dans ``isympy`` :
pl: W ``isympy``:
ru: В ``isympy``:
sr: Користећи ``isympy``:

source: Algebraic equations
de: Algebraische Gleichungen
fr: Équations algébriques
pl: Równania algebraiczne
ru: Алгебраические уравнения
sr: Алгебарска рачун

source: Linear Algebra
de: Lineare Algebra
fr: Algèbre linéaire
pl: Algebra liniowa
ru: Линейная алгебра
sr: Линеарна алгебра

source: Matrices are created as instances from the Matrix class:
de: Matrizen werden als Instanzen der Matrix-Klasse erzeugt:
fr: Les matrices sont créées en instanciant la classe Matrix :
pl: Macierze są tworzone jako obiekty klasy Matrix:
ru: Матрицы задаются с помощью конструктора Matrix:
sr: Матрице се праве као инстанце класе Matrix:

source: They can also contain symbols:
de: Sie können auch Symbole enthalten:
fr: Elles peuvent aussi contenir des symboles :
ru: В матрицах вы также можете использовать символьные переменные:

source: For more about Matrices, see the Linear Algebra tutorial.
de: Mehr Informationen und Beispiele zu Matrizen finden sich im LinearAlgebraTutorial.
fr: Pour plus d'informations et d'exemples avec les Matrices, voyez le Tutoriel Algèbre Linéaire.
ru: Для того, чтобы узнать о матрицах подробнее, прочитайте, пожалуйста, Руководство по Линейной Алгебре.

source: Pattern matching
de: Musterabgleich
fr: Filtrage par motif
pl: Wyszukiwanie wzorca
ru: Сопоставление с образцом
sr: Поклапање образаца

source: Use the ``.match()`` method, along with the ``Wild`` class, to perform pattern matching on expressions. The method will return a dictionary with the required substitutions, as follows:
de: Die Methode ``.match()`` kann gemeinsam mit der Klasse ``Wild`` Ausdrücke auf Muster überprüfen. Die Methode gibt ein dictionary mit den nötigen Ersetzungen zurück, wie im folgenden Beispiel ersichtlich:
fr: Utilisez la méthode ``.match()``, accompagnée de la classe ``Wild``, pour effectuer un filtrage par motif sur des expressions. La méthode renvoit un dictionnaire avec les substitutions requises, comme suit :
pl: Użyj metody ``.match()`` z klasy ``Wild``, by wyszukać wzorzec w wyrażeniu (porównać wyrażenia). Metoda ta zwróci zbiór odpowiadających sobie współczynników:
ru: Чтобы сопоставить выражения с образцами, используйте функцию ``.match()`` вместе со вспомогательным классом ``Wild``. Эта функция вернет словарь с необходимыми заменами, например:
sr: Користите метод ``.match()`` са класом ``Wild``, да би извршили образац одговарајуће на изразе. Овај метод ће вратити речник (dictionary) са потребним изменама, као:

source: If the match is unsuccessful, it returns ``None``:
de: Wenn der Musterabgleich fehlschlägt, wird ``None`` zurückgegeben:
fr: Si le filtrage est infructueux, ``None`` est renvoyé :
pl: Jeśli wyszukiwanie zakończyło się niepowodzeniem, zwracane jest ``None``:
ru: Если же сопоставление не удалось, функция вернет``None``:
sr: Ако је претрага неуспешна, метода враћа ``None``:

source: One can also use the exclude parameter of the ``Wild`` class to ensure that certain things do not show up in the result:
de: Über den Parameter ``exclude`` kann man manches aus dem Ergebnis ausschließen:
fr: On peut aussi utiliser le paramètre ``exclude`` de la classe ``Wild`` pour s'assurer que certaines choses ne figurent pas dans le résultat :
pl: Można również użyć parametru wykluczania (exclude) klasy ``Wild``, by zagwarantować, że w wyniku nie zostaną pokazane niektóre rzeczy:
ru: Также можно использовать параметр exclude для исключения некоторых значений из результата:
sr: Можете користити параметар exclude класе ``Wild`` да би били сигурни да се одређене ствари неће приказати у реѕултату:

source: Printing
de: Ausgabe
fr: Affichage
pl: Wyświetlanie
ru: Печать
sr: Штампање

source: There are many ways to print expressions.
de: Es existieren mehrere Wege, Ausdrücke auszugeben:
fr: Les expressions peuvent être affichées de plusieures façons.
ru: Реализовано несколько способов вывода выражений на экран.

source: **Standard**
fr: **Affichage standard**
pl: **Standardowe**
ru: **Стандартный**
sr: **Стандардно**

source: This is what ``str(expression)`` returns and it looks like this:
de: Dies ist die Ausgabe von ``str(expression)`` und sieht so aus:
fr: C'est ce que ``str(expression)`` renvoit et ça ressemble à ça :
pl: Jest to to, co zwraca ``str(wyrażenie)`` i wygląda tak:
ru: Стандартный способ представлен функцией ``str(expression)``, которая работает следующим образом:
sr: Ово је резултат методе ``str(expression)`` и изгледа као:

source: **Pretty printing**
de: **ASCII-Art-Ausgabe**
fr: **Affichage amélioré**
pl: **Ładne wyświetlanie**
ru: **Красивая печать**
sr: **Лепше штампање**

source: Nice ascii-art printing is produced by the ``pprint`` function:
de: Eine ``pprint``-Funktion erzeugt diese hübschere ASCII-Art-Ausgabe.
fr: Ceci est un affichage amélioré en art ASCII produit par la fonction ``pprint`` :
ru: Этот способ печати выражений основан на ascii-графике и реализован через функцию ``pprint``:

source: If you have a unicode font installed, the ``pprint`` function will use it by default. You can override this using the ``use_unicode`` option.:
de: Wenn eine Unicode-Schriftart installiert ist, sollte die ASCII-Art-Ausgabe standardmäßig die Unicode-Fassung verwenden. Dies kann mit dem Parameter ``use_unicode`` erzwungen oder abgeschaltet werden.
fr: Si vous avez une police unicode installée, l'affichage amélioré l'utilisera par défaut. Vous pouvez outrepasser ce comportement en utilisant l'option ``use_unicode`` :
ru: Если у вас установлен шрифт с юникодом, он будет использовать Pretty-print с юникодом по умолчанию. Эту настройку можно отключить, используя ``use_unicode``:

source: See also the wiki `Pretty Printing <https://github.com/sympy/sympy/wiki/Pretty-Printing>`_ for more examples of a nice unicode printing.
de: Siehe auch die Wiki-Seite `Pretty Printing <https://github.com/sympy/sympy/wiki/Pretty-Printing>`_ für mehr Beispiele von hübschen Unicode-Ausgaben.
fr: Voyez aussi la page wiki `Pretty Printing <https://github.com/sympy/sympy/wiki/Pretty-Printing>`_ pour plus d'exemples concernant l'affichage amélioré et l'option unicode.
pl: Zobacz również wiki `Pretty Printing <https://github.com/sympy/sympy/wiki/Pretty-Printing>`_, gdzie znajdziesz więcej przykładów ładnego wyświetlania w unicode.
ru: Для изучения подробных примеров работы Pretty-print с юникодом вы можете обратится к статье `Pretty Printing <https://github.com/sympy/sympy/wiki/Pretty-Printing>`_ из нашего Вики.
sr: Погледајте и вики `Pretty Printing <https://github.com/sympy/sympy/wiki/Pretty-Printing>`_ за више примера лепог уникодног штампања.

source: Tip: To make pretty printing the default in the Python interpreter, use:
de: Tipp: Die ASCII-Art-Ausgabe kann auch als Standard-Methode gesetzt werden:
fr: Astuce : pour activer l'affichage amélioré par défaut dans l'interpréteur Python, utilisez :
ru: Совет: Чтобы активировать Pretty-print по умолчанию в интерпретаторе Python, используйте:

source: **Python printing**
de: **Python-Ausgabe**
fr: **Python**
pl: **Wyświetlanie w Pythonie**
ru: **Печать объектов Python**
sr: **Python штампање**

source: **LaTeX printing**
de: **LaTeX-Ausgabe**
fr: **LaTeX**
pl: **Wyświetlanie w LaTeX-u**
ru: **Печать в формате LaTeX**
sr: **LaTeX штампање**

source: If pyglet is installed, a pyglet window will open containing the LaTeX rendered expression:
de: Dies öffnet ein pyglet-Fenster mit dem in LaTeX gerenderten Ausdruck, wenn pyglet installiert ist:
fr: Si pyglet est installé, une fenêtre pyglet apparaîtra avec l'expression rendue par LaTeX :
ru: Появится окно pyglet с отрисованным выражением LaTeX:

source: ``isympy`` calls ``pprint`` automatically, so that's why you see pretty printing by default.
de: ``isympy`` ruft ``pprint`` automatisch auf -- deswegen sind die Ausgaben standardmäßig hübsch.
fr: ``isympy`` appelle ``pprint`` automatiquement, c'est donc pourquoi vous voyez un affichage amélioré par défaut.
pl: ``isympy`` wywołuje ``pprint`` automatycznie, dlatego domyślnie jest tam używane ładne wyświetlanie.
ru: ``isympy`` вызывает ``pprint`` автоматически, по этой причине Pretty-print будет включен в ``isympy`` по умолчанию.
sr: ``isympy`` позива ``pprint`` аутоматски , зато видите лепо штампање као подразумевано.

source: Note that there is also a printing module available, ``sympy.printing``. Other printing methods available through this module are:
de: Es ist gibt auch ein Ausgabemodul ``sympy.printing``. Andere Ausgabemethoden, die durch dieses Modul erreichbar sind:
fr: Notez qu'il y a aussi un module d'affichage disponible, ``sympy.printing``. D'autres méthodes d'affichage disponibles dans ce module sont :
pl: Warto zauważyć, że jest dostępny także moduł wyświetlania, ``sympy.printing``. Dzięki niemu można skorzystać z innych sposobów wyświetlania:
ru: Также доступен модуль печати - ``sympy.printing``. Через этот модуль доступны следующий функции печати:
sr: Такође постоји модул за штампање, ``sympy.printing``. Остали доступни методи штампања су:

source: ``pretty(expr)``, ``pretty_print(expr)``, ``pprint(expr)``: Return or print, respectively, a pretty representation of ``expr``. This is the same as the second level of representation described above.
fr: ``pretty(expr)``, ``pretty_print(expr)``, ``pprint(expr)``: Renvoit ou affiche, respectivement, une représentation améliorée de ``expr``. C'est la même chose que le second niveau de représentation décrit ci-dessus.
pl: ``pretty(expr)``, ``pretty_print(expr)``, ``pprint(expr)``: odpowiednio zwraca lub wyświetla ładną reprezentację wyrażenia ``expr``. Jest to to samo, co drugi sposób wyświetlania opisany powyżej.
ru: ``pretty(expr)``, ``pretty_print(expr)``, ``pprint(expr)``: Возвращает или выводит на экран, соответственно, "Красивое" представление выражения ``expr``.
sr: ``pretty(expr)``, ``pretty_print(expr)``, ``pprint(expr)``: Враћа или штампа, лепо представљање од ``expr``. Ово је исто као и други ново представљања опсаног изнад.

source: ``latex(expr)``, ``print_latex(expr)``: Return or print, respectively, a `LaTeX <http://www.latex-project.org/>`_ representation of ``expr``
fr: ``latex(expr)``, ``print_latex(expr)``: Renvoit ou affiche, respectivement, une représentation `LaTeX <http://www.latex-project.org/>`_ de ``expr``
pl: ``latex(expr)``, ``print_latex(expr)``: odpowiednio zwraca lub wyświetla reprezentację wyrażenia ``expr`` w `LaTeX <http://www.latex-project.org/>`_-u.
ru: ``latex(expr)``, ``print_latex(expr)``: Возвращает или выводит на экран, соответственно, `LaTeX <http://www.latex-project.org/>`_ -представление ``expr``
sr: ``latex(expr)``, ``print_latex(expr)``: Враћа или штампа `LaTeX <http://www.latex-project.org/>`_ представљање од ``expr``
