Repository: alxspopov/sympy
Catalog: doc/src/tutorial/tutorial.*.po
Languages: de, fr, pl, ru, sr

source: ``mathml(expr)``, ``print_mathml(expr)``: Return or print, respectively, a `MathML <http://www.w3.org/Math/>`_ representation of ``expr``.
fr: ``mathml(expr)``, ``print_mathml(expr)``: Renvoit ou affiche, respectivement, une représentation `MathML <http://www.w3.org/Math/>`_ de ``expr``.
pl: ``mathml(expr)``, ``print_mathml(expr)``: odpowiednio zwraca lub wyświetla reprezentację wyrażenia ``expr`` w `MathML <http://www.w3.org/Math/>`_-u.
ru: ``mathml(expr)``, ``print_mathml(expr)``: Возвращает или выводит на экран, соответственно, `MathML <http://www.w3.org/Math/>`_ -представление ``expr``.
sr: ``mathml(expr)``, ``print_mathml(expr)``: Враћа или штампа `MathML <http://www.w3.org/Math/>`_ представљање од ``expr``.

source: ``print_gtk(expr)``: Print ``expr`` to `Gtkmathview <http://helm.cs.unibo.it/mml-widget/>`_, a GTK widget that displays MathML code. The `Gtkmathview <http://helm.cs.unibo.it/mml-widget/>`_ program is required.
fr: ``print_gtk(expr)``: Affiche ``expr`` dans `Gtkmathview <http://helm.cs.unibo.it/mml-widget/>`_, un widget GTK qui affiche du code MathML. Le programme `Gtkmathview <http://helm.cs.unibo.it/mml-widget/>`_ est requis.
pl: ``print_gtk(expr)``: wysyła wyrażenie ``expr`` do `Gtkmathview <http://helm.cs.unibo.it/mml-widget/>`_, czyli widgetu GTK, który wyświetla kod MathML. Wymagany jest program `Gtkmathview <http://helm.cs.unibo.it/mml-widget/>`_.
ru: ``print_gtk(expr)``: Вывод ``expr`` в `Gtkmathview <http://helm.cs.unibo.it/mml-widget/>`_, виджет GTK, который отображает код MathML. Необходимо наличие пакета `Gtkmathview <http://helm.cs.unibo.it/mml-widget/>`_ .
sr: ``print_gtk(expr)``: Штампа ``expr`` у `Gtkmathview <http://helm.cs.unibo.it/mml-widget/>`_, и GTK додатак који приказује MathML код. `Gtkmathview <http://helm.cs.unibo.it/mml-widget/>`_ програм је потребан.

source: Further documentation
de: Weitere Dokumentation
fr: Documentation
pl: Dalsza dokumentacja
ru: Другие справочники
sr: Додатна документација

source: Now it's time to learn more about SymPy. Go through the :ref:`SymPy User's Guide <guide>` and :ref:`SymPy Modules Reference <module-docs>`.
de: Nun ist Zeit, mehr über SymPy zu lernen. Lies den `SymPy User's Guide <../guide.html>`_ und die `SymPy Modules Reference <../modules/index.html>`_.
fr: Il est maintenant temps d'en apprendre plus sur SymPy. Consultez le `SymPy User's Guide <../guide.html>`_ et la `SymPy Modules Reference <../modules/index.html>`_.
pl: Teraz nadszedł czas, by dowiedzieć się więcej na temat SymPy. Przejdź do `Przewodniku użytkownika <../guide.html>`_ oraz `Opisu modułów SymPy <../modules/index.html>`_.
ru: Чтобы узнать о SymPy подробнее, обратитесь `Руководство пользователя SymPy <../guide.html>`_ и `Описание модулей SymPy <../modules/index.html>`_.
sr: Сада можете учити даље. Погледајте: `SymPy User's Guide <../guide.html>`_ и `SymPy Modules Reference <../modules/index.html>`_. Напомена: Остатак документације је доступан само на енглеском језику.

source: Be sure to also browse our public `wiki.sympy.org <http://wiki.sympy.org/>`_, that contains a lot of useful examples, tutorials, cookbooks that we and our users contributed, and feel free to edit it.
de: Unser öffentliches Wiki unter `wiki.sympy.org <http://wiki.sympy.org/>`_, enthält einen Haufen nützlicher Beispiele und Anleitungen von uns und unseren Nutzern. (Fühle dich frei, dazu beizutragen und Dinge zu verändern!)
fr: Veillez également à consulter notre `wiki.sympy.org <http://wiki.sympy.org/>`_ public, qui contient beaucoup d'exemples utiles, des tutoriels, des livres de recettes auxquels nous et nos utilisateurs ont contribué et que nous vous encourageons à modifier.
ru: Также можно обратится на `wiki.sympy.org <http://wiki.sympy.org/>`_ - сайт, который содержит множество полезных примеров, руководств и советов. Они созданны нами и нашим сообществом. Мы будем рады, если и вы внесете в него свой весомый вклад.

source: Translations
fr: Traductions
ru: Переводы

source: This tutorial is also available in other languages:
fr: Ce tutoriel est aussi disponible dans les langues suivantes :
ru: Этот текст доступен на других языках:

source: Introduction
de: Einführung
pl: Wprowadzenie
ru: Введение
sr: Увод

source: Matrices
de: Matrizen
pl: Macierze
ru: Матрицы
sr: Матрице

source: Notes
de: Hinweise
pl: Uwagi
ru: Примечания
sr: Белешке
